{"id":3,"date":"2023-04-23T22:23:59","date_gmt":"2023-04-23T22:23:59","guid":{"rendered":"https:\/\/escrow.berkshireconsulting.co\/?page_id=3"},"modified":"2023-05-19T05:22:51","modified_gmt":"2023-05-19T05:22:51","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/berkshireconsulting.co\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-page\" data-elementor-id=\"3\" class=\"elementor elementor-3\">\n\t\t\t\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-a35420c elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"a35420c\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-8844377\" data-id=\"8844377\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-element elementor-element-c5ba1fd elementor-widget elementor-widget-text-editor\" data-id=\"c5ba1fd\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<style>\/*! elementor - v3.13.3 - 28-05-2023 *\/\n.elementor-widget-text-editor.elementor-drop-cap-view-stacked .elementor-drop-cap{background-color:#69727d;color:#fff}.elementor-widget-text-editor.elementor-drop-cap-view-framed .elementor-drop-cap{color:#69727d;border:3px solid;background-color:transparent}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap{margin-top:8px}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap-letter{width:1em;height:1em}.elementor-widget-text-editor .elementor-drop-cap{float:left;text-align:center;line-height:1;font-size:50px}.elementor-widget-text-editor .elementor-drop-cap-letter{display:inline-block}<\/style>\t\t\t\t<p><!-- wp:heading --><\/p>\n<h3>Background<\/h3>\n<p><!-- \/wp:heading --><!-- wp:paragraph --><\/p>\n<p>(1.1)&nbsp;Berkshire collects and uses certain Personal Data and is responsible for ensuring that it uses Personal Data in compliance with data protection laws.<\/p>\n<p>(1.2)&nbsp;At Berkshire, we respect your privacy and we are committed to keeping your Personal Data secure.<\/p>\n<p>(1.3) This Privacy Policy is directed to individuals whose Personal Data we handle in the course of carrying on our commercial activities, whether they are our Clients or prospective Clients or their representatives, agents or appointees, or an employee, director, officer or representative of the other organisations with which we have a business relationship. This Privacy Policy is also directed to visitors to our websites.<\/p>\n<p><!-- \/wp:paragraph --><!-- wp:heading --><\/p>\n<h3>Overview of circumstances in which we handle your personal data<\/h3>\n<p><!-- \/wp:heading --><!-- wp:paragraph --><\/p>\n<p>(2.1)&nbsp;This Privacy Policy concerns any information that we collect in the following ways:<\/p>\n<p>(A) Information we receive through Berkshire<strong>&nbsp;Websites<\/strong>. Details of how we handle the information we receive through Berkshire&nbsp;Websites are set out in paragraph 10 of this Privacy Policy; and<\/p>\n<p>(B) Information we receive as a result of Berkshire<strong>&nbsp;Products and Services<\/strong>.&nbsp;<\/p>\n<h3>The types of personal data we collect<\/h3>\n<p><!-- \/wp:heading --><!-- wp:paragraph --><\/p>\n<p>Many of the products or services offered by Berkshire&nbsp;require us to obtain Personal Data in order to provide the products and services we have been engaged to provide. We will collect and process the following Personal Data:<\/p>\n<p>(3.1) Many of the products or services offered by Berkshire&nbsp;require us to obtain Personal Data in order to provide the products and services we have been engaged to provide. We will collect and process the following Personal Data:<\/p>\n<ul>\n<li><strong>Information that you provide to Berkshire.<\/strong>&nbsp;This includes information about you that you provide to us. The nature of our relationship with you will determine the kind of Personal Data we might ask for, though such information may include:\n<p>&nbsp; &nbsp; &nbsp;&nbsp;◦ &nbsp; basic Personal Data such as first name; family name; national insurance number; email address; phone number; address (including city postcode and country); occupation and job title; bank details; ID documentation; date of birth; life events and family information;<\/p>\n<p>&nbsp; &nbsp; &nbsp;&nbsp;◦ &nbsp; sensitive Personal Data, which may be included in information we handle about your nationality, place of birth, health-related information, disability status, or details of political affiliations.<\/p>\n<\/li>\n<\/ul>\n<ul>\n<li><strong>Information that we collect or generate about you.<\/strong>&nbsp;This may include:\n<p>&nbsp; &nbsp; &nbsp;◦ &nbsp; files that we may produce as a record of our relationship with our Clients and prospective Clients, including contact history; and<\/p>\n<p>&nbsp; &nbsp; &nbsp;◦ &nbsp; any Personal Data that you provide during telephone and email communications with us which we may monitor and record in order to resolve complaints, improve our service and in order to comply with our legal and regulatory requirements or any Personal Data that we obtain in relation to your use of Berkshire Websites.<\/p>\n<\/li>\n<\/ul>\n<ul>\n<li><strong>Information we obtain from other sources.<\/strong>&nbsp;This may include:\n<p>&nbsp; &nbsp; &nbsp;◦ &nbsp; information from publicly available sources, including third party agencies such as credit reference agencies; fraud prevention agencies; law enforcement agencies; public databases, registers and records such as Companies House and the FCA Register; and other publicly accessible sources;&nbsp;<\/p>\n<p>&nbsp; &nbsp; &nbsp;◦ &nbsp; information obtained from independent financial advisors (IFAs), other professional advisers, product providers, events organisers, and other agents and\/or representatives; and&nbsp;<\/p>\n<p>&nbsp; &nbsp; &nbsp;◦ &nbsp; information obtained from sanctions checking and background screening providers.<\/p>\n<\/li>\n<\/ul>\n<p><!-- \/wp:paragraph --><!-- wp:heading --><\/p>\n<h3>How we use your information<\/h3>\n<p><!-- \/wp:heading --><!-- wp:paragraph --><\/p>\n<p>(4.1) Your Personal Data may be stored and processed by us in the following ways and for the following purposes:<\/p>\n<ul>\n<li>to allow Clients and prospective Clients to use and access Berkshire Products and Services;<\/li>\n<li>to assess Client and prospective Client applications or contracts for Berkshire Products and Services;<\/li>\n<li>to set up \/ on-board prospective Clients to use Berkshire Products and Services;<\/li>\n<li>to keep our records up to date;<\/li>\n<li>to monitor IT systems in order to protect against cyber threats or malicious activity including abuse and misuse;<\/li>\n<li>to administer or maintain IT systems in order to uphold standards of service;<\/li>\n<li>for ongoing review and improvement of the information provided on Berkshire &nbsp;Websites to make them user-friendly and prevent potential disruptions or cyber-attacks;<\/li>\n<li>to understand feedback on Berkshire Products and Services and to help provide more information on the use of those products and services quickly and easily;<\/li>\n<li>to communicate with Clients and prospective Clients in order to provide services or information about Berkshire and other Berkshire Products and Services;<\/li>\n<li>to effectively manage and strengthen Client and prospective Client relationships, understand Client and prospective Client needs and interests and learn more about our Clients and prospective Clients in order to develop, improve and manage the products and services we can offer;<\/li>\n<li>for the management and administration of our business;<\/li>\n<li>in order to comply with and in order to assess compliance with applicable laws, rules and regulations, and internal policies and procedures; or<\/li>\n<li>for the administration and maintenance of databases storing your Personal Data.&nbsp;<\/li>\n<\/ul>\n<p>(4.2)&nbsp;When we use your Personal Data, we comply&nbsp;with applicable law. The law allows or requires us to use your Personal Data for a variety of reasons. These include instances where:<\/p>\n<ul>\n<li>we are performing our contractual obligations;<\/li>\n<li>we have legal and regulatory obligations that we have to discharge;&nbsp;<\/li>\n<li>we may need to do so in order to establish, exercise or defend our legal rights or those of our Clients or for the purpose of legal proceedings;<\/li>\n<li>we have obtained your consent;<\/li>\n<li>the use of your Personal Data as described is necessary for our legitimate business interests, such as:\n<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;◦ &nbsp; allowing us to effectively and efficiently manage and administer the operation of our business;<\/p>\n<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;◦ &nbsp; maintaining compliance with internal policies and procedures;<\/p>\n<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;◦ &nbsp; enabling quick and easy access to information on Berkshire Products and Services; and<\/p>\n<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;◦ &nbsp; offering effective, up-to-date security solutions for mobile devices and IT systems.<\/p>\n<\/li>\n<\/ul>\n<p>(4.3) Within Berkshire your Personal Data is accessed only by employees of Berkshire that have a need to access it for the purposes described in this Privacy Policy.<\/p>\n<h3>Disclosure of your information to third parties<\/h3>\n<p><!-- \/wp:heading --><!-- wp:paragraph --><\/p>\n<p>(5.1) We may share your Personal Data within the Berkshire Group for the purposes described above.<\/p>\n<p>(5.2) We may also share your Personal Data outside of the Berkshire Group as further described below:<\/p>\n<ul>\n<li>with business partners of ours where they are contractually obliged to comply with appropriate data protection obligations;<\/li>\n<li>with representatives, agents, custodians, intermediaries and\/or other third-party product providers appointed by the Client or prospective Client (such as accountants, professional advisors, custody service providers and product providers);<\/li>\n<li>with third-party agents and contractors for the purposes of them providing services both to us (for example, Berkshires’accountants, professional advisors, IT and communications providers, background screening providers, credit reference agencies and debt collectors) and to Clients or prospective Clients. These third parties will be subject to appropriate data protection obligations;<\/li>\n<li>with any depository, stock exchange, clearing or settlement system, counterparties, dealers and others where disclosure of your Personal Data is reasonably intended for the purpose of effecting, managing or reporting transactions or establishing a relationship with a view to such transactions;<\/li>\n<li>where you are a joint account or portfolio holder (or otherwise one of the multiple persons holding an account or portfolio), we may disclose your Personal Data to the other joint account or portfolio holder or other people;<\/li>\n<li>to the extent required by law or regulation, for example, if we are under a duty to disclose your Personal Data in order to comply with any legal obligation (including, without limitation, in order to comply with tax reporting requirements and disclosures to regulators, auditors or public authorities), or to establish, exercise or defend its legal rights; and<\/li>\n<li>if we sell any part of our business or our assets, in which case we may need to disclose your Personal Data to the prospective buyer for due diligence purposes.&nbsp;<\/li>\n<\/ul>\n<p><!-- \/wp:paragraph --><!-- wp:heading --><\/p>\n<h3>International transfers of personal data<\/h3>\n<p><!-- \/wp:heading --><!-- wp:paragraph --><\/p>\n<p>(6.1) Berkshire is a global business with Clients and operations around the world. As a result, we collect and transfer Personal Data on a global basis. That means that we may transfer your Personal Data to locations outside of your country.<\/p>\n<p>(6.2) Where we transfer your Personal Data to another country it will be protected and transferred in a manner consistent with legal requirements. In relation to data being transferred outside of the European Economic Area (the “EEA”), for example, this may be done in one of the following ways:<\/p>\n<ul>\n<li>the country to which we send your Personal Data might be approved by the European Commission as offering an adequate level of protection for Personal Data;<\/li>\n<li>the recipient might have signed up to a contract based on “model contractual clauses” approved by the European Commission, obliging it to protect your Personal Data;<\/li>\n<li>where the recipient is located in the US, it might be a certified member of the EU-US Privacy Shield scheme; or<\/li>\n<li>in other circumstances the law may permit us to otherwise transfer your Personal Data outside the EEA.<\/li>\n<\/ul>\n<p>(6.3) You can obtain more details of the protection given to your Personal Data when it is transferred outside the EEA by contacting us as described in paragraph 12 below.<\/p>\n<p><!-- \/wp:paragraph --><!-- wp:heading --><\/p>\n<h3>How we safeguard your personal data<\/h3>\n<p><!-- \/wp:heading --><!-- wp:paragraph --><\/p>\n<p>(7.1) Data is a critical business asset and must be protected appropriately to its risk as well as its importance or value. We operate layers of safeguards and defences designed to ensure that Berkshire is able to operate safely. We have extensive controls and mechanisms in place designed to detect, respond and recover in case of any adverse events that may arise.<\/p>\n<p><!-- \/wp:heading --><!-- wp:paragraph --><\/p>\n<p>(8.1) The length of time for which we hold your Personal Data will vary as determined by the following criteria:<\/p>\n<ul>\n<li>the purpose for which we are using it (as further described in this Privacy Policy at paragraph 4.1) – we will need to keep the data for as long as is necessary for that purpose; and<\/li>\n<li>our legal obligations – laws or regulations may set a minimum period for which we have to keep your Personal Data.<\/li>\n<\/ul>\n<p><!-- \/wp:paragraph --><!-- wp:heading --><\/p>\n<h3>Your rights<\/h3>\n<p><!-- \/wp:heading --><!-- wp:paragraph --><\/p>\n<p>(9.1) In all the above cases in which we collect, use or store your Personal Data, you may have the following rights and, in most cases, you can exercise them free of charge. These rights include:<\/p>\n<ul>\n<li>the right to obtain information regarding the processing of your Personal Data and access to the Personal Data which we hold about you;<\/li>\n<li>the right to withdraw your consent to the processing of your Personal Data at any time. Please note, however, that we may still be entitled to process your Personal Data if we have another legitimate reason for doing so. For example, we may need to retain your Personal Data to comply with a legal or regulatory obligation or to satisfy our internal audit requirements;<\/li>\n<li>in some circumstances, the right to receive some Personal Data in a structured, commonly used and machine-readable format and\/or request that we transmit such data to a third party where this is technically feasible. Please note that this right only applies to Personal Data that you have provided directly to Berkshire;<\/li>\n<li>the right to request that we rectify your Personal Data if it is inaccurate or incomplete;<\/li>\n<li>the right to request that we erase your Personal Data in certain circumstances. Please note that there may be circumstances where you ask us to erase your Personal Data but we are required or entitled to retain it;<\/li>\n<li>the right to object to, or request that we restrict, our processing of your Personal Data in certain circumstances. Again, there may be circumstances where you object to, or ask us to restrict, our processing of your Personal Data but we are required or entitled to refuse that request; and<\/li>\n<li>the right to lodge a complaint with the relevant data protection regulator if you think that any of your rights have been infringed by us.<\/li>\n<\/ul>\n<p>(9.2) You can exercise your rights by contacting us using the details provided in paragraph 12 below.<\/p>\n<p><!-- \/wp:paragraph --><\/p>\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>Background (1.1)&nbsp;Berkshire collects and uses certain Personal Data and is responsible for ensuring that it uses Personal Data in compliance with data protection laws. (1.2)&nbsp;At Berkshire, we respect your privacy and we are committed to keeping your Personal Data secure. (1.3) This Privacy Policy is directed to individuals whose Personal Data we handle in the [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"open","template":"","meta":{"content-type":"","_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0},"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/berkshireconsulting.co\/wp-json\/wp\/v2\/pages\/3"}],"collection":[{"href":"https:\/\/berkshireconsulting.co\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/berkshireconsulting.co\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/berkshireconsulting.co\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/berkshireconsulting.co\/wp-json\/wp\/v2\/comments?post=3"}],"version-history":[{"count":28,"href":"https:\/\/berkshireconsulting.co\/wp-json\/wp\/v2\/pages\/3\/revisions"}],"predecessor-version":[{"id":7664,"href":"https:\/\/berkshireconsulting.co\/wp-json\/wp\/v2\/pages\/3\/revisions\/7664"}],"wp:attachment":[{"href":"https:\/\/berkshireconsulting.co\/wp-json\/wp\/v2\/media?parent=3"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}