{"id":5579,"date":"2022-10-17T16:47:40","date_gmt":"2022-10-17T16:47:40","guid":{"rendered":"https:\/\/themepanthers.com\/wp\/creote\/v2-new\/?page_id=12"},"modified":"2023-05-18T15:46:12","modified_gmt":"2023-05-18T15:46:12","slug":"terms-condition","status":"publish","type":"page","link":"https:\/\/berkshireconsulting.co\/terms-condition\/","title":{"rendered":"Terms &#038; Condition"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-page\" data-elementor-id=\"5579\" class=\"elementor elementor-5579\">\n\t\t\t\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-0a96422 elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"0a96422\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-5c67bb1\" data-id=\"5c67bb1\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-widget-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-element elementor-element-9fddab9 elementor-widget elementor-widget-text-editor\" data-id=\"9fddab9\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<style>\/*! elementor - v3.13.3 - 28-05-2023 *\/\n.elementor-widget-text-editor.elementor-drop-cap-view-stacked .elementor-drop-cap{background-color:#69727d;color:#fff}.elementor-widget-text-editor.elementor-drop-cap-view-framed .elementor-drop-cap{color:#69727d;border:3px solid;background-color:transparent}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap{margin-top:8px}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap-letter{width:1em;height:1em}.elementor-widget-text-editor .elementor-drop-cap{float:left;text-align:center;line-height:1;font-size:50px}.elementor-widget-text-editor .elementor-drop-cap-letter{display:inline-block}<\/style>\t\t\t\t<!-- wp:paragraph -->\n<h3 class=\"mt-5 theme-color-1\">THIS AGREEMENT<\/h3>\n<!-- \/wp:paragraph --><!-- wp:paragraph -->\n<p>This agreement is between us, Berkshire Consulting – BC, and you, the person, persons or corporate entity or entities with whom we have opened or more accounts. It covers our banking accounts and corresponding banking services. If the terms enlisted herein do not suit you best, please endeavor to reach out to us.<br \/><br \/>Where they are relevant, we have used industry standard terms and definitions in this agreement and other related documents.<br \/><br \/>To contact you, we will use the most recent email address, telephone and mobile numbers which you have given us and also, we may use web push notifications. To warn you about any actual or suspected fraud or security breach or threats, we will use the fastest and most secure way of contacting you which may be either through text or email address<\/p>\n<ul class=\"list-unstyled advantages-list\">\n<li style=\"list-style-type: none;\">\n<ul class=\"list-unstyled advantages-list\">You must tell us as soon as possible if any of your contact details change. If you do not, we would not in any way, manner or from be held liable if you do not get any notices or information from us.<\/ul>\n<\/li>\n<\/ul>\n<p> <\/p>\n<ul class=\"list-unstyled advantages-list\">We may record\n<li>other and monitor calls so we can improve our services and for security reasons;<\/li>\n<li>if cellphone number you call us from and may use them if we need to contact you urgently.<\/li>\nWe will always use our official language to communicate with you<\/ul>\n<p>The address for the bank, Berkshire Consulting – BC is Paphos Banking Center, Griva Digeni Ave., CY &#8211; Paphos, Cyprus. If the need to get in touch arises, please visit our website – universalbanks.com and view our other contact information and use it as it suits you most.<\/p>\n<ul><!-- \/wp:list-item --><\/ul>\n<!-- \/wp:list --><!-- wp:paragraph -->\n<h3 class=\"mt-5 theme-color-1\">USING YOUR ACCOUNT<\/h3>\n<!-- \/wp:paragraph --><!-- wp:paragraph -->\n<p><b>2.1. How we make sure we are dealing with you<\/b><\/p>\n<p>Before we do certain things with regards to your account, we may need to check that we are dealing with you, either directly or indirectly and that you have authorized the action which we are taking on your behalf. For instance, if we get a document, we will check the signature on the document or any encrypted means of identification to make sure it matches our record. In all other cases, we will assume we are dealing with you and that we are authorized to take action if your security details are used with cellphone or a telephone.<\/p>\n<p> <\/p>\n<p><b>2.2. Keeping up security<\/b><\/p>\n<p>We will do all we reasonably can to prevent unauthorized access to your account. You must also act reasonably to prevent misuse of your account by keeping your payment devices and security details safe. If you do not, we may restrict access to your account to protect you and us being the bank from unauthorized use. If you ask, we will tell you when the restriction will be eased<br \/><br \/>There are several security tips on our website, please check for any updates we may make from time to time.<br \/><br \/>You must contact us as soon as possible if someone else tries to access or has accessed your account without your consent of which you must have been notified and also, if you lose any of your security details which may put your account safety at risk.<br \/><br \/>We will ask for information or other help and we may assist and ask you to assist with any police investigation. You must not use your account while the investigation is ongoing as this may stall the efforts to resolve the issues and compensate for any losses if any<\/p>\n<p> <\/p>\n<p><b>2.3. Someone else operating your account<\/b><\/p>\n<p>You can allow another person operate your account for you as you wish and desire but to do this, you will need to give us a signed third-party mandate or a power of attorney.<br \/><br \/>If you are unable to operate your account for any reason such as mental or physical incapacity, someone else may be appointed to act and operate it on your behalf. When we have received the right legal document, we will allow that person to use your account. Until then, we will not allow you or any other account holder to process any withdrawal, close or convert the nature or type of account.<br \/><br \/>These conditions apply to any person allowed or appointed to use your account on your behalf but you will be responsible and liable for any and everything they do, even if they make you break any binding agreement.<br \/><br \/>We remove the third-party mandate immediately if you ask us to or we suspect misuse of your account by that person or the person breaches these terms or any law or regulation and we will refuse to accept instructions under a power of attorney if we know that a person’s legal authority to act for you or on your behalf has ended.<\/p>\n<p> <\/p>\n<p><b>2.4. Operating joint accounts<\/b><\/p>\n<p>Where this is more than one account holder, each can operate the account and we will not check with the others before carrying out any instructions from any one of you with regards to the account, including any request for an arranged overdrafts. After one of you tells us there is a dispute, all of you must operate the account together but if the account is empty and has no funds, just one of you can as us to close it.<br \/><br \/>If we have been given official evidence that one of you has died, we will transfer the account into the name of the remaining account holder or holders. If we convert an account from sole to joint, the new account holder can see all the account information, including when it was a sole account.<br \/><br \/>We will convert an account from joint names to a sole name if you ask us and all of the account holders agree. Once we do this, you cannot later convert it back to a joint account.<\/p>\n<p> <\/p>\n<p><b>2.5. Using information about you<\/b><\/p>\n<p>If we make a reasonable request for information, you must give it to us as soon as possible. If you do not, or we suspect fraudulent or criminal activity of any kind, we might try to get it from another source, we could block or close your account or accounts or you might not be able to access some banking services or keep banking with us.<br \/><br \/>You must make sure the information you give us is accurate and up to date and tell us if anything changes within thirty days. We will use your information as explained in our privacy notice. We will also give it to others if required by law or public duty, for instance, if we believe you may have tax obligations in other countries, we may have to disclose that information directly to tax authorities or if we need to disclose to protect our own interests, particularly in any legal proceedings or we have your specific agreement.<\/p>\n<p> <\/p>\n<p><b>2.6. Compliance with tax order<\/b><\/p>\n<p>Your tax responsibilities, such as filing tax returns, paying taxes and complying with any other tax laws or regulations depend on where you live, where you do business and some other factors. It is up to you to make sure you meet these obligations. We cannot provide tax or legal advice so if you think having or operating an account with Berkshire Consulting – BC might affect your tax position, you should speak to an independent advisor.<br \/><br \/>This also applies to connected persons, for instance, anyone you send a payment to, who operates an account for you, is entitled to money in your account or accounts etcetera.<\/p>\n<!-- \/wp:paragraph --><!-- wp:paragraph -->\n<h3 class=\"mt-5 theme-color-1\">PAYMENTS – WITHDRAWALS AND DEPOSITS<\/h3>\n<!-- \/wp:paragraph --><!-- wp:paragraph -->\n<p><b>3.1. Deposits into your account &#8211; funding<\/b><\/p>\n<p>There are several means money can be deposited into your account using several cryptocurrencies in different denominations as you desire. These currencies are clearly outlined on your user dashboard with the funding procedures simple and clear. In funding your account, ensure you confirm the amount you wish to fund and the receiving address as designated on your dashboard.<\/p>\n<p> <\/p>\n<p><b>3.2. Funding by mistake or fraud<\/b><\/p>\n<p>We will take back any money we pay into your account by mistake or due to a system error. If we are told that a payment from within the EEA was not meant for you, for instance, if the payer used the wrong account ID, we will contact you. If you tell us the payment was not a mistake, we are legally required to share all relevant information with the payer if confirmed and needful including your name and address and transaction information, so that the payer can contact you directly.<br \/><br \/>In all other cases, the steps we will take will depend on how the payment was made and where it came from.<br \/><br \/>For all other payments, we will not take the money out of your account and return it to the payer unless it is confirmed after investigations and you agree. If we suspect any payment into your account was the result of fraud, we can remove it without asking you. If you do not have enough money in your account or under an arranged overdraft when we return a payment for any of these reasons, this will result in an unarranged overdraft<\/p>\n<p> <\/p>\n<p><b>3.3. Blocking payments and services<\/b><\/p>\n<p>We can block any payment device and your access to related services if we reasonably believe it is necessary because of either a significantly increased risk that you may be unable to pay any money you owe us on the relevant account or suspected fraudulent or criminal use of the payment device or security concerns, for instance, if we know or suspect your payment device or security details have been misused. If we do this, we will usually let you know why immediately afterwards, unless we are prevented by law or any regulation or for security reasons. We will unblock the payment device as soon as the reason for blocking it ends.<br \/><br \/>Your account or accounts may be temporarily or permanently suspended for breach of the agreements we have with you and failure to adhere to the bank directives and instructions which are meant to ensure a smooth running of the bank and has every likelihood to obstruct the delivery of the services of which we are responsible for to our clients.<\/p>\n<p> <\/p>\n<p><b>3.4. Refunds<\/b><\/p>\n<p>We do not make any form of refunds unless we have solid and legally-backed proof of any mistakes of happenstance<\/p>\n<!-- \/wp:paragraph --><!-- wp:paragraph -->\n<h3 class=\"mt-5 theme-color-1\">OUR RELATIONSHIP WITH YOU<\/h3>\n<!-- \/wp:paragraph --><!-- wp:paragraph -->\n<p><b>4.1. Changes we can make after giving advance notice<\/b><\/p>\n<p>Our agreement has no fixed end date so it is likely we will need to keep our terms up to date so they cover changes we are making to our business and changes we do not control. We will only make changes for several reasons if it is reasonable for us to pass on the impact of that change. As we cannot foretell precisely why we might need to make changes to this agreement, we may also make changes for reasons that may not be disclosed herein.<br \/><br \/>If we give advance notice that we are going to make a change to this agreement and you do not tell us you want to close your account before that change takes place, or within the next sixty days or longer, then we will assume you have accepted the change and it will apply automatically at the end of the notice period.<\/p>\n<p> <\/p>\n<p><b>4.2. Closing your account and ending this agreement with us<\/b><\/p>\n<p>You can close your account or end a service or this agreement without charge by telling us in branch, by telephone or online within the cooling off period which is twenty days from the day after we have confirmed we have opened your account if you opened your account online or at any time.<br \/><br \/>You may have to pay charges for using the account. We will close the account and send you the amount in it and any interest when everything you may owe us has been paid. Any account benefits will end. To initiate a closure of account, you can make a request of our account closure form from any of our certified administrators from any of our platforms and then complete and send to us.<\/p>\n<p> <\/p>\n<p><b>4.3. When we are not liable or responsible for anything<\/b><\/p>\n<p>We will not be responsible for any losses you may suffer if we cannot perform our obligations under this agreement due to any legal or regulatory requirements or abnormal or unforeseeable circumstances which are outside our or our agents’ or subcontractors’ control and which we could not have avoided despite all efforts to the contrary, such as industrial action or mechanical failure.<\/p>\n<p> <\/p>\n<p><b>4.4. Privacy<\/b><\/p>\n<p>Your privacy is important to Universal Banks &#8211; UB.<br \/><br \/>You explicitly consent to us accessing, processing, and retaining any information you provide to us, for the purposes of providing payment services to you. This does not affect any rights and obligations you or we have under data protection legislation. You may withdraw this consent by closing your account. If you do this, we will stop using your data for this purpose, but may continue to process your data for other purposes.<br \/><br \/>Our privacy notice explains how we collect, use, disclose, transfer, and store your information and sets out your rights to your information. We have provided our privacy notice to you separately and will inform you when we make any changes to it. You can also find this at universalbanks.com or you can ask for a copy.<\/p>\n<p> <\/p>\n<p><b>4.5. Complaints<\/b><\/p>\n<p>There are several ways which you can file complaints or relay your concerns. Please refer to our complaint handling policy for instructions and guidelines on how to do so<\/p>\n<p> <\/p>\n<p><b>4.6. Deposit protection<\/b><\/p>\n<p>We are covered by the Financial Services Compensation Scheme &#8211; FSCS. The FSCS can pay compensation to depositors and investors alike if a bank is unable to meet its financial obligations. Most depositors are covered by the scheme<\/p>\n<!-- \/wp:paragraph --><!-- wp:paragraph -->\n<h3 class=\"mt-5 theme-color-1\">ACCESSIBILITY<\/h3>\n<!-- \/wp:paragraph --><!-- wp:paragraph -->\n<p><b>If you need any of this information in a different format, please let us know. This includes large print, braille, or audio. You can speak to us using the live chat on our website or by giving us a call.<\/b><\/p>\n<p>There are also lots of other options available to help you communicate with us. Some of these are provided by third parties who are responsible for the service.<\/p>\n<h3 class=\"mt-5 theme-color-1\">PAYMENTS – WITHDRAWALS AND DEPOSITS<\/h3>\n<!-- \/wp:paragraph --><!-- wp:paragraph -->\n<p><b>6.1. Deposits into your account &#8211; funding<\/b><\/p>\n<p>There are several means money can be deposited into your account using several cryptocurrencies in different denominations as you desire. These currencies are clearly outlined on your user dashboard with the funding procedures simple and clear. In funding your account, ensure you confirm the amount you wish to fund and the receiving address as designated on your dashboard.<\/p>\n<!-- \/wp:paragraph -->\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>THIS AGREEMENT This agreement is between us, Berkshire Consulting – BC, and you, the person, persons or corporate entity or entities with whom we have opened or more accounts. It covers our banking accounts and corresponding banking services. If the terms enlisted herein do not suit you best, please endeavor to reach out to us.Where [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"content-type":"","_mi_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0},"aioseo_notices":[],"_links":{"self":[{"href":"https:\/\/berkshireconsulting.co\/wp-json\/wp\/v2\/pages\/5579"}],"collection":[{"href":"https:\/\/berkshireconsulting.co\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/berkshireconsulting.co\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/berkshireconsulting.co\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/berkshireconsulting.co\/wp-json\/wp\/v2\/comments?post=5579"}],"version-history":[{"count":11,"href":"https:\/\/berkshireconsulting.co\/wp-json\/wp\/v2\/pages\/5579\/revisions"}],"predecessor-version":[{"id":7655,"href":"https:\/\/berkshireconsulting.co\/wp-json\/wp\/v2\/pages\/5579\/revisions\/7655"}],"wp:attachment":[{"href":"https:\/\/berkshireconsulting.co\/wp-json\/wp\/v2\/media?parent=5579"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}